{"name":"Vy Cao's portfolio","headerTaglineOne":"Hello 👋,","headerTaglineTwo":"I'm Vy Cao,  ","headerTaglineThree":"A Computer Science student specialized in Artificial Intelligence","headerTaglineFour":"Focused on building intelligent systems with Machine Learning, NLP, and Deep Learning","showCursor":true,"showBlog":false,"darkMode":false,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/VyCaoH"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/caovy/"},{"id":"5","title":"Email","link":"mailto:yenvy.caohoai@gmail.com"}],"projects":[{"id":"1","title":"Hate Speech Detection","description":"Developed a Transformer-based model using the HateXplain dataset to classify input text into hateful, offensive, or normal categories, aiming to enhance content moderation by distinguishing varying degrees of harmful language.","imageSrc":"https://images.unsplash.com/photo-1611162617213-7d7a39e9b1d7?q=80&w=1974&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D", "url":"https://www.kaggle.com/code/kitsunee1404/finalproject"},{"id":"2","title":"Winx (Project in Vietnam Datathon 2023)","description":"Analyzed CCTV footage to identify in-store customer behavior patterns and proposed real-time dynamic advertising adjustments to enhance marketing effectiveness.","imageSrc":"https://images.unsplash.com/photo-1520256839924-866b3dc87c71?q=80&w=1976&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D", "url":"https://drive.google.com/drive/folders/1Ye7EVbU50jmVsttmcyism9auqSZR7H32?usp=sharing"},{"id":"3","title":"FoodFeast","description":"A mobile app that suggests personalized recipes based on user input, with themed dish listings, rankings, and social sharing features.","imageSrc":"https://images.unsplash.com/photo-1511690656952-34342bb7c2f2?q=80&w=1964&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D","url":"https://drive.google.com/file/d/1aLcRayzTiI4Fb7hmdYtS8Jxl7tgBbs6B/view?usp=sharing"},{"id":"4","title":"Bicomplex Embeddings in Multimodal Knowledge Graph Completion","description":"My undergraduate thesis exploring the use of bicomplex embeddings to model multimodal datasets and address challenges in multimodal knowledge graph completion.","imageSrc":"https://images.unsplash.com/photo-1728652964288-e2a54f061b46?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D","url":"https://github.com/VyCaoH/MMKG-BiCore.git"}],"leadership":[{"title":"Organizer – University’s Largest IT Academic Competition","description":"Co-organized and coordinated logistics, communications, and technical operations for the university's largest annual academic competition in Information Technology, attracting hundreds of student participants."},{"title":"Core Member – Student Club for IT Activities & Engagement","description":"Actively participated in planning and hosting student events, technical workshops, and social programs to promote peer learning and collaboration within the university’s IT student community."},{"title":"TEDx Organizer – TEDx Event Featuring AI & Automation Expert","description":"Co-hosted a TEDx event featuring Udhir Tiku (AI and Automation Expert), aimed at promoting public awareness and interdisciplinary dialogue around emerging AI technologies and their impact on society."}],"services":[{"id":"1","title":"Participated in Code Like a Girl 2023","description":"A mobile app promoting environmental sustainability by enabling users to spontaneously offer or request rides from one another, reducing traffic congestion and carbon emissions through a community-driven ride-sharing model."},{"id":"2","title":"Participated in She Codes Hackathon 2023","description":"A web platform where users can become mentors in their areas of expertise and receive guidance from others in return. I contributed primarily to idea development and led the UI/UX design management."},{"id":"3","title":"Participated in TikTok TechJam 2024","description":"We developed a generative AI-powered tool to help content creators generate ideas and produce content faster and more creatively."}],"awards":[{"title":"GeoComply Hope Scholarship – April 2024","description":"Awarded for outstanding academic performance and active involvement in extracurricular activities in the field of Information Technology."},{"title":"Dean’s List – Semester 1 and 3 (2022) & Semester 3 (2024)","description":"Recognized for exceptional academic achievements, consistently ranking among the top students, and actively participating in university activities."},{"title":"Top 24 Vietnam Datathon 2024","description":"Led analysis of customer behavior trends from CCTV data, contributed core ideas, guided project direction, and oversaw UI design for a dynamic in-store advertising screen."}],"aboutpara":"I am a dedicated and forward-thinking Computer Science student with a strong focus on Artificial Intelligence. I am driven by a constant desire to learn, improve, and contribute to meaningful technological solutions. With every project, I seek not only to apply what I know but to expand my capabilities—technically, creatively, and collaboratively. My goal is to grow into a developer who builds systems that are both intelligent and impactful."}